[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:11:13
   const objectToAxiosParams = (ucsborganization) => ({
     url: "/api/ucsborganizations/post",
     method: "POST",
-    params: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
+    params: {},
   });
 
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": "false",
-   "orgCode": "ZPR",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:19:43
     },
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(
-      `New organization Created - id: ${ucsborganization.id} orgCode: ${ucsborganization.orgCode}`,
-    );
-  };
+  const onSuccess = (ucsborganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New organization Created - id: 4 orgCode: ZPR"

Number of calls: 0
