[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsborganizations?code=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsborganizations`,
-      params: {
-        code: id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      code: id,
-    },
-    data: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Organization Updated - id: SKY1 orgCode: SKY1"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:28:57
     },
   );
 
-  const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      code: id,
-    },
-    data: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = (ucsborganization) => ({});
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Organization Updated - id: SKY1 orgCode: SKY1"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:29:10
   );
 
   const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/ucsborganizations",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Organization Updated - id: SKY1 orgCode: SKY1"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:42:43
     },
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(
-      `Organization Updated - id: ${ucsborganization.orgCode} orgCode: ${ucsborganization.orgCode}`,
-    );
-  };
+  const onSuccess = (ucsborganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:44:7
 
   const onSuccess = (ucsborganization) => {
     toast(
-      `Organization Updated - id: ${ucsborganization.orgCode} orgCode: ${ucsborganization.orgCode}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Organization Updated - id: SKY1 orgCode: SKY1"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Organization</h1>
-        {ucsborganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsborganization}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Organization</h1>
-        {ucsborganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsborganization}
-          />
-        )}
+        {ucsborganization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsborganization} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationsEditPage tests when the backend doesn't return data renders header but form is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBOrganizationForm-orgCode" id="orgCode" name="orgCode" type="text" /> instead
