[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:57:43
   ];
   // Stryker restore all
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    // Stryker disable all: do not mutate admin button pushes
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-    // Stryker restore all
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={requests} columns={columns} testid={testIdPrefix} />;
killedBy: RecommendationRequestIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
