[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:58:46
               id="requesterEmail"
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: true,
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /requesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "requesterEmail is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /requesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "requesterEmail is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /requesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/HelpRequests/HelpRequestForm.js:76:27
               type="text"
               isInvalid={Boolean(errors.teamId)}
               {...register("teamId", {
-                required: true,
+                required: false,
               })}
             />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /teamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.js:80:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.teamId && "teamId is required. "}
+              {errors.teamId || "teamId is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:80:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.teamId && "teamId is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /teamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:94:51
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: true,
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /tableOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/HelpRequests/HelpRequestForm.js:95:27
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
               {...register("tableOrBreakoutRoom", {
-                required: true,
+                required: false,
               })}
             />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /tableOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:99:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.tableOrBreakoutRoom &&
-                "tableOrBreakoutRoom is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /tableOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:99:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.tableOrBreakoutRoom &&
-                "tableOrBreakoutRoom is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /tableOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.js:113:28
               type="datetime-local"
               step="1"
               isInvalid={Boolean(errors.localDateTime)}
-              {...register("requestTime", {
+              {...register("", {
                 required: true,
                 pattern: isodate_regex,
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/HelpRequests/HelpRequestForm.js:114:27
               step="1"
               isInvalid={Boolean(errors.localDateTime)}
               {...register("requestTime", {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /requestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:119:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "requestTime is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /requestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:119:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "requestTime is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /requestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:136:28
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
                 required: "Explanation is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Explanation must be 255 characters or less.",
-                },
+                maxLength: {},
               })}
             />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Explanation must be 255 characters or less./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/HelpRequests/HelpRequestForm.js:166:16
               <option value="false">false</option>
             </Form.Select>
             <Form.Control.Feedback type="invalid">
-              {errors.solved?.message}
+              {errors.solved.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
