[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.js:15:34
 export default function HelpRequestTable({ helprequests, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/helprequests/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequests/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:43:15
       accessor: "requesterEmail",
     },
     {
-      Header: "Team ID",
+      Header: "",
       accessor: "teamId",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Team ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:47:15
       accessor: "teamId",
     },
     {
-      Header: "Table Or Breakout Room",
+      Header: "",
       accessor: "tableOrBreakoutRoom",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Table Or Breakout Room. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="tab

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.js:54:5
       Header: "Request Time",
       accessor: "requestTime",
     },
-    {
-      Header: "Explanation",
-      accessor: "explanation",
-    },
+    {},
 
     {
killedBy: HelpRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:55:15
       accessor: "requestTime",
     },
     {
-      Header: "Explanation",
+      Header: "",
       accessor: "explanation",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Explanation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:56:17
     },
     {
       Header: "Explanation",
-      accessor: "explanation",
+      accessor: "",
     },
 
killedBy: HelpRequestsIndexPage tests renders three help requests correctly for regular user
statusReason: TestingLibraryElementError: Unable to find an element with the text: the screen is broken. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.js:59:5
       accessor: "explanation",
     },
 
-    {
-      Header: "Solved",
-      accessor: "solved",
-      Cell: ({ value }) => String(value),
-    },
+    {},
   ];
 
killedBy: HelpRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/HelpRequests/HelpRequestTable.js:62:13
     {
       Header: "Solved",
       accessor: "solved",
-      Cell: ({ value }) => String(value),
+      Cell: () => undefined,
     },
   ];
killedBy: HelpRequestsIndexPage tests renders three help requests correctly for regular user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.js:66:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: HelpRequestsIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.js:71:30
       ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"),
+      ButtonColumn("Delete", "", deleteCallback, "HelpRequestTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
