[Killed] BooleanLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.js:7:62
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function HelpRequestsCreatePage({ storybook = false }) {
+export default function HelpRequestsCreatePage({ storybook = true }) {
   const objectToAxiosParams = (helprequest) => ({
     url: "/api/helprequests/post",
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/helprequests"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helprequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helprequest.requesterEmail,
-      teamId: helprequest.teamId,
-      tableOrBreakoutRoom: helprequest.tableOrBreakoutRoom,
-      requestTime: helprequest.requestTime,
-      explanation: helprequest.explanation,
-      solved: helprequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helprequest) => {
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsCreatePage.js:21:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(
-      `New help request Created - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New help request Created - id: 1 requesterEmail: cgaucho@ucsb.edu"

Number of calls: 0

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsCreatePage.js:36:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    // data.solved = data.solved === "true"; // convert to boolean
-    data.requestTime = data.requestTime.split(".")[0]; // strip milliseconds if needed
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.js:38:47
 
   const onSubmit = async (data) => {
     // data.solved = data.solved === "true"; // convert to boolean
-    data.requestTime = data.requestTime.split(".")[0]; // strip milliseconds if needed
+    data.requestTime = data.requestTime.split("")[0]; // strip milliseconds if needed
     mutation.mutate(data);
   };
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "explanation": "the screen is broken",
-   "requestTime": "2025-05-05T01:01:05",
