[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestsIndexPage.js:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/helprequests/all"],
-    { method: "GET", url: "/api/helprequests/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HelpRequestsIndexPage tests renders three help requests correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
