[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsEditPage.js:29:10
   );
 
   const objectToAxiosPutParams = (helprequest) => ({
-    url: "/api/helprequests",
+    url: "",
     method: "PUT",
     params: {
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Help Request Updated - id: 1 requester email: bobo@ucsb.edu"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsEditPage.js:44:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(
-      `Help Request Updated - id: ${helprequest.id} requester email: ${helprequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
