[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:65:32
           id="name"
           type="text"
           isInvalid={Boolean(errors.name)}
-          {...register("name", {
-            required: "Name is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("name", {})}
         />
         <Form.Control.Feedback type="invalid">
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:85:35
           id="station"
           type="text"
           isInvalid={Boolean(errors.station)}
-          {...register("station", {
-            required: "Station is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("station", {})}
         />
         <Form.Control.Feedback type="invalid">
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Station is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
