[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:30:34
     },
   );
 
-  const objectToAxiosPutParams = (menuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
-    params: {
-      id: menuitem.id,
-    },
-    data: {
-      diningCommonsCode: menuitem.diningCommonsCode,
-      name: menuitem.name,
-      station: menuitem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuitem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu Item Updated - id: 17 diningCommonsCode: Carrillo"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:43:35
     },
   });
 
-  const onSuccess = (menuitem) => {
-    toast(
-      `Menu Item Updated - id: ${menuitem.id} diningCommonsCode: ${menuitem.diningCommonsCode}`,
-    );
-  };
+  const onSuccess = (menuitem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:45:7
 
   const onSuccess = (menuitem) => {
     toast(
-      `Menu Item Updated - id: ${menuitem.id} diningCommonsCode: ${menuitem.diningCommonsCode}`,
+      ``,
     );
   };
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Menu Item Updated - id: 17 diningCommonsCode: Carrillo"
Received: ""

Number of calls: 1

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {menuitem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuitem}
-          />
-        )}
+        {menuitem || <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={menuitem} />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, diningCommonsCode, name, station}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {menuitem && (
-          <UCSBDiningCommonsMenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuitem}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
